src/result/wrk_results.txt
ServiceImpl
GET
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.305ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.311ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.325ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.316ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.12ms    4.85ms  83.58ms   95.60%
    Req/Sec     1.33k   310.82     6.11k    90.93%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.29ms
 75.000%    1.82ms
 90.000%    2.44ms
 99.000%   21.20ms
 99.900%   70.53ms
 99.990%   81.73ms
 99.999%   83.46ms
100.000%   83.65ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.081     0.000000            1         1.00
       0.496     0.100000        10004         1.11
       0.758     0.200000        20006         1.25
       0.955     0.300000        30009         1.43
       1.127     0.400000        40027         1.67
       1.288     0.500000        50034         2.00
       1.375     0.550000        55005         2.22
       1.467     0.600000        60015         2.50
       1.574     0.650000        65016         2.86
       1.691     0.700000        69997         3.33
       1.820     0.750000        75007         4.00
       1.891     0.775000        77497         4.44
       1.970     0.800000        79989         5.00
       2.055     0.825000        82485         5.71
       2.157     0.850000        85006         6.67
       2.281     0.875000        87494         8.00
       2.355     0.887500        88742         8.89
       2.445     0.900000        89977        10.00
       2.577     0.912500        91227        11.43
       2.941     0.925000        92478        13.33
       4.061     0.937500        93726        16.00
       4.851     0.943750        94350        17.78
       5.907     0.950000        94978        20.00
       7.003     0.956250        95600        22.86
       8.191     0.962500        96230        26.67
       9.503     0.968750        96849        32.00
      10.279     0.971875        97162        35.56
      11.111     0.975000        97474        40.00
      12.063     0.978125        97787        45.71
      13.199     0.981250        98101        53.33
      14.767     0.984375        98411        64.00
      16.255     0.985938        98569        71.11
      18.127     0.987500        98726        80.00
      19.871     0.989062        98880        91.43
      22.239     0.990625        99036       106.67
      25.007     0.992188        99193       128.00
      26.783     0.992969        99274       142.22
      30.015     0.993750        99349       160.00
      34.879     0.994531        99427       182.86
      39.935     0.995313        99506       213.33
      44.351     0.996094        99583       256.00
      46.655     0.996484        99622       284.44
      49.311     0.996875        99663       320.00
      51.679     0.997266        99701       365.71
      55.391     0.997656        99739       426.67
      60.671     0.998047        99778       512.00
      62.015     0.998242        99798       568.89
      63.231     0.998437        99817       640.00
      65.215     0.998633        99837       731.43
      67.711     0.998828        99856       853.33
      70.911     0.999023        99876      1024.00
      72.447     0.999121        99886      1137.78
      73.727     0.999219        99895      1280.00
      75.391     0.999316        99906      1462.86
      76.671     0.999414        99915      1706.67
      77.631     0.999512        99925      2048.00
      78.015     0.999561        99930      2275.56
      78.527     0.999609        99935      2560.00
      78.911     0.999658        99939      2925.71
      79.615     0.999707        99944      3413.33
      80.127     0.999756        99949      4096.00
      80.383     0.999780        99952      4551.11
      80.831     0.999805        99956      5120.00
      80.831     0.999829        99956      5851.43
      81.343     0.999854        99960      6826.67
      81.407     0.999878        99962      8192.00
      81.727     0.999890        99963      9102.22
      81.983     0.999902        99964     10240.00
      82.047     0.999915        99965     11702.86
      82.175     0.999927        99967     13653.33
      82.175     0.999939        99967     16384.00
      82.303     0.999945        99968     18204.44
      82.623     0.999951        99969     20480.00
      82.623     0.999957        99969     23405.71
      82.943     0.999963        99970     27306.67
      82.943     0.999969        99970     32768.00
      83.263     0.999973        99971     36408.89
      83.263     0.999976        99971     40960.00
      83.263     0.999979        99971     46811.43
      83.455     0.999982        99972     54613.33
      83.455     0.999985        99972     65536.00
      83.455     0.999986        99972     72817.78
      83.455     0.999988        99972     81920.00
      83.455     0.999989        99972     93622.86
      83.647     0.999991        99973    109226.67
      83.647     1.000000        99973          inf
#[Mean    =        2.116, StdDeviation   =        4.853]
#[Max     =       83.584, Total count    =        99973]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  149995 requests in 30.00s, 9.87MB read
  Non-2xx or 3xx responses: 149995
Requests/sec:   4999.86
Transfer/sec:    336.90KB


PUT
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.262ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.238ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.253ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.240ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.64ms    4.06ms  77.31ms   98.73%
    Req/Sec     1.32k   215.59     4.90k    85.37%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.23ms
 75.000%    1.65ms
 90.000%    2.07ms
 99.000%   12.52ms
 99.900%   63.04ms
 99.990%   73.79ms
 99.999%   76.80ms
100.000%   77.38ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.101     0.000000            1         1.00
       0.510     0.100000        10020         1.11
       0.744     0.200000        20015         1.25
       0.928     0.300000        30009         1.43
       1.082     0.400000        40005         1.67
       1.230     0.500000        50021         2.00
       1.303     0.550000        54983         2.22
       1.380     0.600000        59997         2.50
       1.461     0.650000        65004         2.86
       1.549     0.700000        69979         3.33
       1.647     0.750000        75011         4.00
       1.702     0.775000        77501         4.44
       1.761     0.800000        80002         5.00
       1.824     0.825000        82481         5.71
       1.896     0.850000        84990         6.67
       1.974     0.875000        87490         8.00
       2.017     0.887500        88726         8.89
       2.065     0.900000        89999        10.00
       2.113     0.912500        91240        11.43
       2.169     0.925000        92500        13.33
       2.231     0.937500        93727        16.00
       2.267     0.943750        94372        17.78
       2.305     0.950000        94985        20.00
       2.349     0.956250        95614        22.86
       2.401     0.962500        96234        26.67
       2.461     0.968750        96857        32.00
       2.495     0.971875        97161        35.56
       2.539     0.975000        97482        40.00
       2.597     0.978125        97788        45.71
       2.685     0.981250        98098        53.33
       3.121     0.984375        98406        64.00
       4.015     0.985938        98563        71.11
       5.947     0.987500        98719        80.00
       9.255     0.989062        98876        91.43
      14.407     0.990625        99031       106.67
      19.775     0.992188        99188       128.00
      24.415     0.992969        99266       142.22
      29.119     0.993750        99344       160.00
      34.079     0.994531        99422       182.86
      38.591     0.995313        99500       213.33
      42.719     0.996094        99579       256.00
      44.767     0.996484        99617       284.44
      46.719     0.996875        99656       320.00
      48.447     0.997266        99695       365.71
      50.943     0.997656        99734       426.67
      54.143     0.998047        99774       512.00
      56.287     0.998242        99793       568.89
      57.823     0.998437        99813       640.00
      59.519     0.998633        99832       731.43
      61.471     0.998828        99851       853.33
      63.199     0.999023        99871      1024.00
      64.351     0.999121        99881      1137.78
      65.023     0.999219        99890      1280.00
      65.983     0.999316        99900      1462.86
      66.879     0.999414        99910      1706.67
      68.031     0.999512        99921      2048.00
      68.671     0.999561        99925      2275.56
      69.311     0.999609        99930      2560.00
      69.887     0.999658        99934      2925.71
      70.655     0.999707        99940      3413.33
      71.231     0.999756        99944      4096.00
      71.871     0.999780        99947      4551.11
      71.999     0.999805        99949      5120.00
      72.511     0.999829        99951      5851.43
      73.151     0.999854        99955      6826.67
      73.791     0.999878        99958      8192.00
      73.791     0.999890        99958      9102.22
      73.855     0.999902        99959     10240.00
      74.303     0.999915        99960     11702.86
      74.367     0.999927        99961     13653.33
      74.431     0.999939        99962     16384.00
      74.687     0.999945        99963     18204.44
      74.879     0.999951        99964     20480.00
      74.879     0.999957        99964     23405.71
      75.519     0.999963        99965     27306.67
      75.519     0.999969        99965     32768.00
      76.159     0.999973        99966     36408.89
      76.159     0.999976        99966     40960.00
      76.159     0.999979        99966     46811.43
      76.799     0.999982        99967     54613.33
      76.799     0.999985        99967     65536.00
      76.799     0.999986        99967     72817.78
      76.799     0.999988        99967     81920.00
      76.799     0.999989        99967     93622.86
      77.375     0.999991        99968    109226.67
      77.375     1.000000        99968          inf
#[Mean    =        1.636, StdDeviation   =        4.059]
#[Max     =       77.312, Total count    =        99968]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  149992 requests in 30.00s, 9.58MB read
Requests/sec:   4999.83
Transfer/sec:    327.14KB


STATUS
Running 10s test @ http://localhost:8080/v0/status
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   291.29us    1.44ms  33.17ms   98.88%
    Req/Sec    27.00k     5.45k   53.33k    89.05%
  Latency Distribution
     50%  162.00us
     75%  176.00us
     90%  206.00us
     99%    1.99ms
  539864 requests in 10.10s, 54.06MB read
Requests/sec:  53453.13
Transfer/sec:      5.35MB

AsyncServiceImpl
GET
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.751ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.733ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.771ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.742ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.26ms  566.17us   3.50ms   64.47%
    Req/Sec     1.32k   120.73     1.78k    68.84%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.23ms
 75.000%    1.67ms
 90.000%    2.05ms
 99.000%    2.52ms
 99.900%    2.75ms
 99.990%    3.03ms
 99.999%    3.28ms
100.000%    3.50ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.146     0.000000            1         1.00
       0.500     0.100000        10006         1.11
       0.752     0.200000        20024         1.25
       0.924     0.300000        30033         1.43
       1.079     0.400000        40041         1.67
       1.228     0.500000        50002         2.00
       1.300     0.550000        55015         2.22
       1.377     0.600000        59989         2.50
       1.463     0.650000        65013         2.86
       1.559     0.700000        69973         3.33
       1.667     0.750000        74970         4.00
       1.726     0.775000        77501         4.44
       1.786     0.800000        80005         5.00
       1.845     0.825000        82493         5.71
       1.909     0.850000        84987         6.67
       1.976     0.875000        87471         8.00
       2.012     0.887500        88722         8.89
       2.051     0.900000        89991        10.00
       2.095     0.912500        91264        11.43
       2.139     0.925000        92469        13.33
       2.191     0.937500        93715        16.00
       2.219     0.943750        94359        17.78
       2.247     0.950000        95010        20.00
       2.273     0.956250        95611        22.86
       2.305     0.962500        96220        26.67
       2.343     0.968750        96866        32.00
       2.361     0.971875        97164        35.56
       2.381     0.975000        97476        40.00
       2.403     0.978125        97776        45.71
       2.429     0.981250        98107        53.33
       2.457     0.984375        98419        64.00
       2.471     0.985938        98561        71.11
       2.489     0.987500        98727        80.00
       2.503     0.989062        98870        91.43
       2.523     0.990625        99039       106.67
       2.543     0.992188        99189       128.00
       2.555     0.992969        99262       142.22
       2.569     0.993750        99338       160.00
       2.583     0.994531        99425       182.86
       2.599     0.995313        99496       213.33
       2.619     0.996094        99571       256.00
       2.631     0.996484        99610       284.44
       2.639     0.996875        99649       320.00
       2.651     0.997266        99689       365.71
       2.667     0.997656        99728       426.67
       2.691     0.998047        99766       512.00
       2.703     0.998242        99787       568.89
       2.715     0.998437        99807       640.00
       2.725     0.998633        99827       731.43
       2.737     0.998828        99848       853.33
       2.753     0.999023        99864      1024.00
       2.769     0.999121        99874      1137.78
       2.777     0.999219        99883      1280.00
       2.789     0.999316        99893      1462.86
       2.803     0.999414        99903      1706.67
       2.815     0.999512        99912      2048.00
       2.843     0.999561        99917      2275.56
       2.855     0.999609        99921      2560.00
       2.875     0.999658        99926      2925.71
       2.897     0.999707        99932      3413.33
       2.905     0.999756        99936      4096.00
       2.933     0.999780        99939      4551.11
       2.945     0.999805        99941      5120.00
       2.959     0.999829        99944      5851.43
       2.979     0.999854        99947      6826.67
       2.999     0.999878        99948      8192.00
       3.029     0.999890        99950      9102.22
       3.041     0.999902        99951     10240.00
       3.043     0.999915        99952     11702.86
       3.047     0.999927        99953     13653.33
       3.055     0.999939        99954     16384.00
       3.147     0.999945        99955     18204.44
       3.171     0.999951        99956     20480.00
       3.171     0.999957        99956     23405.71
       3.175     0.999963        99957     27306.67
       3.175     0.999969        99957     32768.00
       3.207     0.999973        99958     36408.89
       3.207     0.999976        99958     40960.00
       3.207     0.999979        99958     46811.43
       3.281     0.999982        99959     54613.33
       3.281     0.999985        99959     65536.00
       3.281     0.999986        99959     72817.78
       3.281     0.999988        99959     81920.00
       3.281     0.999989        99959     93622.86
       3.499     0.999991        99960    109226.67
       3.499     1.000000        99960          inf
#[Mean    =        1.260, StdDeviation   =        0.566]
#[Max     =        3.498, Total count    =        99960]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  149987 requests in 30.00s, 9.87MB read
  Non-2xx or 3xx responses: 149987
Requests/sec:   4999.68
Transfer/sec:    336.89KB

PUT
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 2.594ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.615ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.418ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.944ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.78ms    4.04ms  70.53ms   97.47%
    Req/Sec     1.32k   246.39     4.30k    94.97%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.23ms
 75.000%    1.66ms
 90.000%    2.12ms
 99.000%   21.71ms
 99.900%   54.40ms
 99.990%   68.67ms
 99.999%   70.27ms
100.000%   70.59ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.117     0.000000            1         1.00
       0.511     0.100000        10019         1.11
       0.738     0.200000        20032         1.25
       0.924     0.300000        30018         1.43
       1.083     0.400000        40036         1.67
       1.232     0.500000        50005         2.00
       1.305     0.550000        54985         2.22
       1.382     0.600000        60005         2.50
       1.463     0.650000        64990         2.86
       1.556     0.700000        69999         3.33
       1.659     0.750000        75002         4.00
       1.714     0.775000        77511         4.44
       1.774     0.800000        80007         5.00
       1.838     0.825000        82492         5.71
       1.914     0.850000        84993         6.67
       2.002     0.875000        87478         8.00
       2.059     0.887500        88732         8.89
       2.115     0.900000        89977        10.00
       2.179     0.912500        91226        11.43
       2.259     0.925000        92487        13.33
       2.355     0.937500        93733        16.00
       2.413     0.943750        94352        17.78
       2.489     0.950000        94976        20.00
       2.597     0.956250        95599        22.86
       2.801     0.962500        96223        26.67
       3.571     0.968750        96847        32.00
       4.475     0.971875        97160        35.56
       5.983     0.975000        97472        40.00
       7.703     0.978125        97785        45.71
      10.095     0.981250        98098        53.33
      13.055     0.984375        98409        64.00
      14.767     0.985938        98566        71.11
      17.103     0.987500        98723        80.00
      19.615     0.989062        98878        91.43
      23.423     0.990625        99035       106.67
      27.407     0.992188        99190       128.00
      29.247     0.992969        99270       142.22
      30.991     0.993750        99347       160.00
      33.375     0.994531        99427       182.86
      36.127     0.995313        99503       213.33
      38.399     0.996094        99581       256.00
      39.263     0.996484        99620       284.44
      40.735     0.996875        99659       320.00
      43.007     0.997266        99698       365.71
      44.895     0.997656        99737       426.67
      46.943     0.998047        99776       512.00
      48.095     0.998242        99796       568.89
      49.279     0.998437        99815       640.00
      50.655     0.998633        99835       731.43
      52.799     0.998828        99854       853.33
      54.751     0.999023        99874      1024.00
      55.743     0.999121        99884      1137.78
      56.351     0.999219        99893      1280.00
      57.343     0.999316        99903      1462.86
      58.399     0.999414        99913      1706.67
      59.711     0.999512        99923      2048.00
      60.703     0.999561        99928      2275.56
      61.951     0.999609        99932      2560.00
      63.583     0.999658        99937      2925.71
      64.799     0.999707        99942      3413.33
      66.239     0.999756        99947      4096.00
      67.007     0.999780        99950      4551.11
      67.135     0.999805        99952      5120.00
      67.519     0.999829        99954      5851.43
      67.967     0.999854        99957      6826.67
      68.095     0.999878        99959      8192.00
      68.671     0.999890        99962      9102.22
      68.671     0.999902        99962     10240.00
      69.055     0.999915        99964     11702.86
      69.055     0.999927        99964     13653.33
      69.183     0.999939        99966     16384.00
      69.183     0.999945        99966     18204.44
      69.311     0.999951        99967     20480.00
      69.311     0.999957        99967     23405.71
      69.375     0.999963        99968     27306.67
      69.375     0.999969        99968     32768.00
      69.759     0.999973        99969     36408.89
      69.759     0.999976        99969     40960.00
      69.759     0.999979        99969     46811.43
      70.271     0.999982        99970     54613.33
      70.271     0.999985        99970     65536.00
      70.271     0.999986        99970     72817.78
      70.271     0.999988        99970     81920.00
      70.271     0.999989        99970     93622.86
      70.591     0.999991        99971    109226.67
      70.591     1.000000        99971          inf
#[Mean    =        1.782, StdDeviation   =        4.040]
#[Max     =       70.528, Total count    =        99971]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  149995 requests in 30.00s, 9.58MB read
Requests/sec:   4999.75
Transfer/sec:    327.13KB

STATUS
Running 10s test @ http://localhost:8080/v0/status
  2 threads and 10 connections
 Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   168.07us   80.84us   4.57ms   95.38%
    Req/Sec    27.71k     1.85k   30.55k    83.17%
  Latency Distribution
     50%  164.00us
     75%  175.00us
     90%  190.00us
     99%  379.00us
  556800 requests in 10.10s, 55.76MB read
Requests/sec:  55133.88
Transfer/sec:      5.52MB


Пропускная способность увеличилась (после перехода от блокирующей к асинхронной реализации):
- почти в 25 раз у метода GET
- немного у метода PUT
- в 3 раза STATUS

Из профилирования видно, что задачи работы с сокетом и задачи работы с хранилищем разделены. Запросы к /status работают быстрее и не ждут пока выполнятся другие запросы, связанные с хранилищем